example/org_to_html/sample.html
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Org Document</title>
</head>
<body>
<h1><span class="todo">TODO</span> <span class="priority-A">[#A]</span> Project Setup</h1>
<p>Setup the initial project structure and dependencies.</p>
<h2><span class="done">DONE</span> <span class="priority-B">[#B]</span> Repository Creation</h2>
<p>Created the git repository and initial structure.</p>


<h2><span class="todo">TODO</span> <span class="priority-A">[#A]</span> Dependencies</h2>
<p>Install required dependencies:</p>
<ul>
<li>Database setup</li>

<li>Web framework</li>

<li>Testing tools</li>

</ul>




<h1><span class="done">DONE</span> Documentation</h1>
<p>Write comprehensive documentation for the project.</p>
<table>
<tr><td>Feature</td><td>Status</td><td>Priority</td></tr>

<tr><td>Auth</td><td>Planning</td><td>High</td></tr>
<tr><td>Dashboard</td><td>Design</td><td>Medium</td></tr>
<tr><td>Reports</td><td>TODO</td><td>Low</td></tr>
</table>



<h1>Code Examples</h1>
<p>Here's a simple function:</p>
<pre><code class="language-elixir">def hello(name) do
  IO.puts(&quot;Hello, #{name}!&quot;)
end</code></pre>

<h2>Implementation Notes</h2>
<p>The function should handle edge cases like empty names.</p>



<h1>Future Plans</h1>

<h2>Development Tasks</h2>
<ul>
<li>Mobile app development<ul>
<li>iOS implementation</li>

<li>Android implementation</li>

</ul>
</li>

<li>API improvements<ul>
<li>Authentication upgrade</li>

<li>Rate limiting</li>

</ul>
</li>

<li>Performance optimization</li>

</ul>



<h2>Priority List</h2>
<ol>
<li>Security audit</li>

<li>User experience improvements<ul>
<li>Better navigation</li>

<li>Faster loading times</li>

</ul>
</li>

<li>Documentation updates</li>

</ol>





</body>
</html>
